/**
 * Перечисление кодов НДС (налога на добавленную стоимость) YooKassa.
 * Используется в позициях корзины, чеках и счетах.
 */
export declare enum VatCodesEnum {
    /**
     * Без НДС.
     */
    NDS_NONE = 1,
    /**
     * НДС 0%.
     */
    NDS_0 = 2,
    /**
     * НДС 10%.
     */
    NDS_10 = 3,
    /**
     * НДС 20%.
     */
    NDS_20 = 4,
    /**
     * НДС 10/110 (расчетный способ).
     * Часто используется для льготных категорий.
     */
    NDS_10_110 = 5,
    /**
     * НДС 20/120 (расчетный способ).
     */
    NDS_20_120 = 6
}
