/**
 * Перечисление поддерживаемых локалей.
 * Каждая локаль представляет собой комбинацию языка и страны.
 * @enum {string}
 */
export declare enum LocaleEnum {
    /**
     * Русский язык.
     */
    ru_RU = "ru_RU",
    /**
     * Английский язык.
     */
    en_US = "en_US"
}
/**
 * Перечисление поддерживаемых валют.
 * Каждая валюта представлена в виде трехбуквенного кода.
 * @enum {string}
 */
export declare enum CurrencyEnum {
    USD = "USD",// Доллар США
    CAD = "CAD",// Канадский доллар
    EUR = "EUR",// Евро
    AED = "AED",// Дирхам ОАЭ
    AFN = "AFN",// Афгани
    ALL = "ALL",// Албанский лек
    AMD = "AMD",// Армянский драм
    ARS = "ARS",// Аргентинский песо
    AUD = "AUD",// Австралийский доллар
    AZN = "AZN",// Азербайджанский манат
    BAM = "BAM",// Конвертируемая марка (Босния и Герцеговина)
    BDT = "BDT",// Бангладешская така
    BGN = "BGN",// Болгарский лев
    BHD = "BHD",// Бахрейнский динар
    BIF = "BIF",// Бурундийский франк
    BND = "BND",// Брунейский доллар
    BOB = "BOB",// Боливийский боливиано
    BRL = "BRL",// Бразильский реал
    BWP = "BWP",// Ботсванская пула
    BYN = "BYN",// Белорусский рубль
    BZD = "BZD",// Белизский доллар
    CDF = "CDF",// Конголезский франк
    CHF = "CHF",// Швейцарский франк
    CLP = "CLP",// Чилийский песо
    CNY = "CNY",// Китайский юань
    COP = "COP",// Колумбийский песо
    CRC = "CRC",// Коста-риканский колон
    CVE = "CVE",// Эскудо Кабо-Верде
    CZK = "CZK",// Чешская крона
    DJF = "DJF",// Франк Джибути
    DKK = "DKK",// Датская крона
    DOP = "DOP",// Доминиканский песо
    DZD = "DZD",// Алжирский динар
    EEK = "EEK",// Эстонская крона
    EGP = "EGP",// Египетский фунт
    ERN = "ERN",// Эритрейская накфа
    ETB = "ETB",// Эфиопский бирр
    GBP = "GBP",// Фунт стерлингов
    GEL = "GEL",// Грузинский лари
    GHS = "GHS",// Ганский седи
    GNF = "GNF",// Гвинейский франк
    GTQ = "GTQ",// Гватемальский кетсаль
    HKD = "HKD",// Гонконгский доллар
    HNL = "HNL",// Гондурасская лемпира
    HRK = "HRK",// Хорватская куна
    HUF = "HUF",// Венгерский форинт
    IDR = "IDR",// Индонезийская рупия
    ILS = "ILS",// Израильский шекель
    INR = "INR",// Индийская рупия
    IQD = "IQD",// Иракский динар
    IRR = "IRR",// Иранский риал
    ISK = "ISK",// Исландская крона
    JMD = "JMD",// Ямайский доллар
    JOD = "JOD",// Иорданский динар
    JPY = "JPY",// Японская иена
    KES = "KES",// Кенийский шиллинг
    KHR = "KHR",// Камбоджийский риель
    KMF = "KMF",// Франк Коморских островов
    KRW = "KRW",// Южнокорейская вона
    KWD = "KWD",// Кувейтский динар
    KZT = "KZT",// Казахстанский тенге
    LBP = "LBP",// Ливанский фунт
    LKR = "LKR",// Шри-ланкийская рупия
    LTL = "LTL",// Литовский лит
    LVL = "LVL",// Латвийский лат
    LYD = "LYD",// Ливийский динар
    MAD = "MAD",// Марокканский дирхам
    MDL = "MDL",// Молдавский лей
    MGA = "MGA",// Мадагаскарский ариари
    MKD = "MKD",// Македонский денар
    MMK = "MMK",// Мьянмский кьят
    MOP = "MOP",// Патака Макао
    MUR = "MUR",// Маврикийская рупия
    MXN = "MXN",// Мексиканское песо
    MYR = "MYR",// Малайзийский ринггит
    MZN = "MZN",// Мозамбикское метикал
    NAD = "NAD",// Намибийский доллар
    NGN = "NGN",// Нигерийская найра
    NIO = "NIO",// Никарагуанская кордоба
    NOK = "NOK",// Норвежская крона
    NPR = "NPR",// Непальская рупия
    NZD = "NZD",// Новозеландский доллар
    OMR = "OMR",// Оманский риал
    PAB = "PAB",// Панамский балбоа
    PEN = "PEN",// Перуанский соль
    PHP = "PHP",// Филиппинское песо
    PKR = "PKR",// Пакистанская рупия
    PLN = "PLN",// Польский злотый
    PYG = "PYG",// Парагвайский гуарани
    QAR = "QAR",// Катарский риал
    RON = "RON",// Румынский лей
    RSD = "RSD",// Сербский динар
    RUB = "RUB",// Российский рубль
    RWF = "RWF",// Руандийский франк
    SAR = "SAR",// Саудовский риал
    SDG = "SDG",// Суданский фунт
    SEK = "SEK",// Шведская крона
    SGD = "SGD",// Сингапурский доллар
    SOS = "SOS",// Сомалийский шиллинг
    SYP = "SYP",// Сирийский фунт
    THB = "THB",// Таиландский бат
    TND = "TND",// Тунисский динар
    TOP = "TOP",// Тонгана паанга
    TRY = "TRY",// Турецкая лира
    TTD = "TTD",// Тринидад и Тобаго доллар
    TWD = "TWD",// Новый тайваньский доллар
    TZS = "TZS",// Танзанийский шиллинг
    UAH = "UAH",// Украинская гривна
    UGX = "UGX",// Угандийский шиллинг
    UYU = "UYU",// Уругвайское песо
    UZS = "UZS",// Узбекский сум
    VEF = "VEF",// Венесуэльский боливар
    VND = "VND",// Вьетнамский донг
    XAF = "XAF",// Франк Центральноафриканского CFA
    XOF = "XOF",// Франк Западноафриканского CFA
    YER = "YER",// Йеменский риал
    ZAR = "ZAR",// Южноафриканский рэнд
    ZMK = "ZMK",// Замбийская квача
    ZWL = "ZWL"
}
/**
 * Тип, представляющий сумму и валюту для платежа.
 */
export interface Amount {
    /**
     * Значение суммы.
     */
    value: number;
    /**
     * Валюта суммы, представленная кодом валюты из перечисления `CurrencyEnum`.
     */
    currency: CurrencyEnum;
}
